[
  {
    "title": "Dua for waking up",
    "arabic": "الحَمْـدُ للهِ الَّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإِلَـيْهِ النُّـشُور",
    "translation": "All praise is for Allah Who gave us life after having taken it from us and unto Him is the resurrection."
  },
  {
    "title": "Dua for sleeping",
    "arabic": "بِاسْمِكَ اللّهُـمَّ أَمُـوتُ وَأَحْـيا",
    "translation": "In Your name O Allah, I die and I live."
  },
  {
    "title": "Dua before eating",
    "arabic": "بِسْمِ اللهِ",
    "translation": "In the name of Allah."
  },
  {
    "title": "Dua after eating",
    "arabic": "الحَمْـدُ للهِ الَّذي أَطْعَمَنا وَسَقانا وَجَعَلَنا مِنَ المُسْلِمين",
    "translation": "Praise be to Allah Who has fed us and given us drink, and made us Muslims."
  },
  {
    "title": "Dua when entering the toilet",
    "arabic": "اللّهُـمَّ إِنِّي أَعـوذُ بِكَ مِنَ الخُبْثِ وَالخَبائِث",
    "translation": "O Allah, I seek refuge in You from male and female devils."
  },
  {
    "title": "Dua when leaving the toilet",
    "arabic": "غُفْـرانَك",
    "translation": "I ask You for forgiveness."
  },
  {
    "title": "Dua when starting ablution",
    "arabic": "بِسْمِ اللهِ",
    "translation": "In the name of Allah."
  },
  {
    "title": "Dua when leaving the house",
    "arabic": "بِسْمِ اللهِ ، تَوَكَّلْتُ عَلَى اللهِ ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ",
    "translation": "In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah."
  },
  {
    "title": "Dua when entering the house",
    "arabic": "بِسْمِ اللهِ وَلَجْنَا، وَبِسْمِ اللهِ خَرَجْنَا، وَعَلَى رَبِّنَا تَوَكَّلْنَا",
    "translation": "In the name of Allah we enter, and in the name of Allah we leave, and upon our Lord we place our trust."
  },
  {
    "title": "Dua when going to the mosque",
    "arabic": "اللّهُـمَّ اجْعَلْ في قَلْبِي نُوراً وَفي لِسَانِي نُوراً وَاجْعَلْ في سَمْعِي نُوراً وَاجْعَلْ في بَصَرِي نُوراً",
    "translation": "O Allah, place light in my heart, light on my tongue, light in my hearing, and light in my sight."
  },
  {
    "title": "Dua after leaving the mosque",
    "arabic": "اللّهُـمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
    "translation": "O Allah, I ask You for Your bounty."
  },
  {
    "title": "Dua when hearing the adhan",
    "arabic": "اللّهُـمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَاةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ",
    "translation": "O Allah, Lord of this perfect call and the established prayer, grant Muhammad the means and virtue."
  },
  {
    "title": "Dua before prayer",
    "arabic": "اللّهُـمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ",
    "translation": "O Allah, distance me from my sins as You have distanced the East from the West."
  },
  {
    "title": "Dua after prayer",
    "arabic": "اللّهُـمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَالإِكْرَامِ",
    "translation": "O Allah, You are Peace, and from You is peace. Blessed are You, O Possessor of majesty and honor."
  },
  {
    "title": "Dua when starting a journey",
    "arabic": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ",
    "translation": "Glory be to Him who has subjected this to us, and we could never have it [by our efforts], and indeed to our Lord we will surely return."
  },
  {
    "title": "Dua when entering the market",
    "arabic": "لَا إِلَٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا يَمُوتُ",
    "translation": "There is no deity but Allah alone, without partner. His is the dominion, and His is the praise. He gives life and causes death, and He is living and does not die."
  },
  {
    "title": "Dua when mounting an animal",
    "arabic": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ",
    "translation": "Glory be to Him who has subjected this to us, and we could never have it [by our efforts], and indeed to our Lord we will surely return."
  },
  {
    "title": "Dua when afflicted with a calamity",
    "arabic": "إِنَّا لِلّهِ وَإِنَّـا إِلَيْهِ رَاجِعونَ",
    "translation": "Indeed, we belong to Allah, and indeed to Him we will return."
  },
  {
    "title": "Dua for protection against enemies",
    "arabic": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
    "translation": "Sufficient for us is Allah, and [He is] the best Disposer of affairs."
  },
  {
    "title": "Dua when fearing harm",
    "arabic": "اللّهُـمَّ اكْفِنِي بِمَا شِئْتَ",
    "translation": "O Allah, protect me by whatever means You will."
  },
  {
    "title": "Dua when entering a new town",
    "arabic": "اللّهُـمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَمَا أَظَلَّتْ وَرَبَّ الأَرَضِينَ السَّبْعِ وَمَا أَقَلَّتْ",
    "translation": "O Allah, Lord of the seven heavens and what they cover, and Lord of the seven earths and what they bear."
  },
  {
    "title": "Dua for seeking guidance",
    "arabic": "اللّهُـمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ",
    "translation": "O Allah, I seek Your guidance through Your knowledge and I seek ability through Your power, and I ask You from Your great bounty."
  },
  {
    "title": "Dua when feeling anxious",
    "arabic": "اللّهُـمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ",
    "translation": "O Allah, I seek refuge in You from anxiety and grief, and I seek refuge in You from incapacity and laziness."
  },
  {
    "title": "Dua when hearing bad news",
    "arabic": "الْحَمْدُ لِلّهِ عَلَى كُلِّ حَالٍ",
    "translation": "Praise be to Allah in all circumstances."
  },
  {
    "title": "Dua when visiting the sick",
    "arabic": "أَسْأَلُ اللهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفِيَكَ",
    "translation": "I ask Allah the Great, Lord of the Great Throne, to cure you."
  },
  {
    "title": "Dua when congratulating someone",
    "arabic": "بَارَكَ اللّهُ لَكَ وَبَارَكَ عَلَيْكَ",
    "translation": "May Allah bless you and shower His blessings upon you."
  },
  {
    "title": "Dua when asking for forgiveness",
    "arabic": "اللّهُـمَّ اغْفِرْ لِي وَارْحَمْنِي وَاهْدِنِي وَعَافِنِي",
    "translation": "O Allah, forgive me, have mercy on me, guide me, and grant me well-being."
  },
  {
    "title": "Dua after sneezing",
    "arabic": "الْحَمْدُ لِلَّهِ",
    "translation": "Praise be to Allah."
  },
  {
    "title": "Dua when starting something new",
    "arabic": "اللّهُـمَّ بَارِكْ لِي فِيهِ",
    "translation": "O Allah, bless me in it."
  },
  {
    "title": "Dua for thanking Allah",
    "arabic": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
    "translation": "Praise be to Allah, Lord of all the worlds."
  },
  {
    "title": "Dua when ending a gathering",
    "arabic": "سُبْحَانَكَ اللّهُـمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ",
    "translation": "Glory is to You, O Allah, and praise is to You. I testify that there is no deity but You."
  }
]
